<?php
$MESS['profile_id'] = 'Идентификатор профайлинга';
$MESS['source'] = 'Источник';
$MESS['graph'] = 'Граф выполнения';
$MESS['date_profiling'] = 'Дата профайлинга';
$MESS['current_function'] = 'Текущая функция:';
$MESS['parent_function'] = 'Родительские функции:';
$MESS['child_function'] = 'Дочерние функции:';
$MESS['all_calls'] = 'Все вызовы:';
$MESS['name_function'] = 'Имя функции/метода';
$MESS['calls_count'] = 'Количество вызовов';
$MESS['calls_percent'] = 'Вызовы (%)';

$MESS['all_time_exec'] = 'Общее время выполнения + системные ресурсы';
$MESS['all_time_exec_percent'] = 'Общее время выполнения + системные ресурсы (%)';
$MESS['avg_all_time_exec'] = 'Общее время выполнения + системные ресурсы (среднее значение - на один вызов)';

$MESS['ex_time_exec'] = 'Время выполнения без вложенных функций + системные ресурсы';
$MESS['ex_time_exec_percent'] = 'Время выполнения без вложенных функций + системные ресурсы (%)';
$MESS['avg_ex_time_exec'] = 'Время выполнения без вложенных функций + системные ресурсы (среднее значение - на один вызов)';

$MESS['time_exec'] = 'Общее время выполнения';
$MESS['time_exec_percent'] = 'Общее время выполнения (%)';

$MESS['ex_time_exec'] = 'Время выполнения без вложенных функций';
$MESS['ex_time_exec_percent'] = 'Время выполнения без вложенных функций (%)';

$MESS['cpu_time_exec'] = 'Процессорное время выполнения';
$MESS['cpu_time_exec_percent'] = 'Процессорное время выполнения (%)';
$MESS['avg_cpu_time_exec'] = 'Процессорное время выполнения (среднее значение - на один вызов)';

$MESS['cpu_ex_time_exec'] = 'Процессорное время выполнения без вложенных функций';
$MESS['cpu_ex_time_exec_percent'] = 'Процессорное время выполнения без вложенных функций (%)';
$MESS['avg_cpu_ex_time_exec'] = 'Процессорное время выполнения без вложенных функций (среднее значение - на один вызов)';

$MESS['memory_usage'] = 'Использование памяти';
$MESS['memory_usage_percent'] = 'Использование памяти (%)';
$MESS['avg_memory_usage'] = 'Использование памяти (среднее значение - на один вызов)';

$MESS['ex_memory_usage'] = 'Использование памяти без вложенных функций';
$MESS['ex_memory_usage_percent'] = 'Использование памяти без вложенных функций (%)';
$MESS['avg_ex_memory_usage'] = 'Использование памяти без вложенных функций (среднее значение - на один вызов)';

$MESS['max_usage_memory'] = 'Пиковое использование памяти';
$MESS['max_usage_memory_percent'] = 'Пиковое использование памяти (%)';
$MESS['ex_max_usage_memory'] = 'Пиковое использование памяти без вложенных функций';
$MESS['ex_max_usage_memory_percent'] = 'Пиковое использование памяти без вложенных функций (%)';
$MESS['delete'] = 'Удалить';
$MESS['edit'] = 'Редактировать';
$MESS['back'] = '<< Назад';
$MESS['profile_list'] = 'Список файлов профайлинга';
